Algo_SAT_TASK_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SAT ANALYSIS TASK 2</title>
<!-- 2017-08-23 Wed 10:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anghelo De La Cruz" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="content">
<h1 class="title">SAT ANALYSIS TASK 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="todo NEXT">NEXT</span> Question 1</a></li>
<li><a href="#sec-2">2. <span class="todo TODO">TODO</span> Question 2</a></li>
<li><a href="#sec-3">3. <span class="todo TODO">TODO</span> Question 3</a></li>
<li><a href="#sec-4">4. <span class="todo TODO">TODO</span> Question 4</a></li>
<li><a href="#sec-5">5. Solution 1</a>
<ul>
<li><a href="#sec-5-1">5.1. Part (a)</a></li>
<li><a href="#sec-5-2">5.2. Part (b)</a></li>
<li><a href="#sec-5-3">5.3. Part (c)</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Solution 2</a></li>
<li><a href="#sec-7">7. Solution 3</a></li>
<li><a href="#sec-8">8. Solution 4</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="todo NEXT">NEXT</span> Question 1</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Using mathematical notation and computer science conventions
describe the time complexity of the algorithm MinOP for the worst
case.
</li>
<li>What are the naive elements of the algorithm MinOP that allow a
specific design pattern to be applied to improve its time
complexity?
</li>
<li>Describe in detail the aspects of the methodology you would use for
the design of the improved algortithm.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Question 2</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Write in pseudocode your own improved time complexity version of
this algorithm. This algorithm should use meaningful variable names,
it should indicate what inputs and outputs are expected, as well as
including comments for complicated commands. Reference to external
procedures or functions that are called should include a measure of
their time complexity.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Question 3</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Describe the relationship in a methodical and systematic way using
mathematrcal notation and computer science conventions for the time
complexity of the new version of algorithm with regards to its input
size and its asymptotic running time in the best and worst cases.
</li>
<li>Desribe the situations where the best case time complexity will
occur and contrast it with the type of input that results in the
worst case time complexity for the new algorithm that you created.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Question 4</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Compare your new algorithm with the orginal MinOP algorithm. Discuss
and highlight the improvements that your new version has made and
specify any trade-offs that you made to achieve the improvement in
time complexity.
</li>
<li>Create a graph of the best and worst case time complexity against
the input size for the orginal algorithm and your improved
version. Clearly label the axes and the lines representing each
algorithm on your graph by either labelling the line or using a
legend.
</li>
<li>Justify the correctness of your new improved algorithm, using a
valid argument. Diagrams may also be used to illustrate your
argument.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Solution 1</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Part (a)</h3>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Part (b)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The algorithm MinOP contains sub-problems that are identical to the
original problem and &#x2014; that allow recursion to be used to solve this
problem. This however is a naive approach to the solution to this
problem. This is shown in the following call tree. This allows a
design pattern such as dynamic programming to be used because of these
sub-problems.
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Part (c)</h3>
<div class="outline-text-3" id="text-5-3">
<p>
There are two ways I would improve this algorithm:
</p>
<ul class="org-ul">
<li>Dyanamic Programming
</li>
<li>Backtracking
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Solution 2</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #74af68;">=begin</span>

<span style="color: #74af68;">INPUTS: n, Operations, Operator, Operand</span>
<span style="color: #74af68;">OUTPUTS: minCount</span>
<span style="color: #74af68;">ASSUMPTIONS: </span>

<span style="color: #74af68;">=end</span>

<span style="color: #34cae2;">Function</span> MinOP()
    <span style="color: #ffad29; font-weight: bold;">def</span> <span style="color: #00ede1; font-weight: bold;">m</span> = [1,] 
    <span style="color: #34cae2;">For</span> i <span style="color: #ffad29; font-weight: bold;">in</span> 2..n <span style="color: #ffad29; font-weight: bold;">do</span>
        set <span style="color: #34cae2;">MinCount</span> = 999999
        <span style="color: #34cae2;">For</span> j <span style="color: #ffad29; font-weight: bold;">in</span> 1..len(operations) <span style="color: #ffad29; font-weight: bold;">do</span>
            <span style="color: #34cae2;">If</span> operator[j] = <span style="color: #e67128;">"-"</span> <span style="color: #ffad29; font-weight: bold;">then</span>
                <span style="color: #34cae2;">If</span> m[i-operand[j]] &lt; minCount <span style="color: #ffad29; font-weight: bold;">then</span>
                    minCount = m[i-<span style="color: #34cae2;">Operand</span>[j]]
            <span style="color: #34cae2;">Elseif</span> <span style="color: #34cae2;">Operator</span>[j] = <span style="color: #e67128;">"/"</span> <span style="color: #ffad29; font-weight: bold;">then</span>
                <span style="color: #34cae2;">If</span> mod(i,<span style="color: #34cae2;">Operand</span>[j]) = 0 <span style="color: #ffad29; font-weight: bold;">then</span>
                    <span style="color: #34cae2;">If</span> m[n/operand[j]] &lt; minCount <span style="color: #ffad29; font-weight: bold;">then</span>
                        minCount = m[n/operand[j]]
            <span style="color: #ffad29; font-weight: bold;">def</span> <span style="color: #00ede1; font-weight: bold;">m[n]</span> = minCount
    <span style="color: #23d7d7;">print</span> <span style="color: #e67128;">"The Minimum amount of operations is "</span> + <span style="color: #74af68;">#</span><span style="color: #74af68;">{minCount}</span>
<span style="color: #ffad29; font-weight: bold;">end</span> function
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Solution 3</h2>
<div class="outline-text-2" id="text-7">
\begin{align*}
O(1) + O(n-1) \bigg( O(m) \big( 6O(1) \big) \bigg)
\end{align*}
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Solution 4</h2>
</div>
</div>
</body>
</html>
